<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>The Black Tomato Reviews</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="IMAGES/backgrounds/starsnatural.jpg" text="#FFFF00" link="#0000FF">
<strong>&Oslash;resund Space Collective: The Black Tomato <br>
Transubstans Records (Transubstans032) </strong> 
<p> As a musician, I just love improvising too, because with pure, open-minded 
  improvisation you can get to places that you could never reach with logically 
  and beforehand structured and planned music. Of course it can happen sometimes 
  that the improvisation just doesn&#8217;t get going at all, which can be frustrating. 
  Improvising in the studio has a positive side compared to improvisation in a 
  live situation: you can let the audience only hear the stuff that really has 
  something mystical going on!</p>
<p>The Danish-Swedish &Oslash;resund Space Collective plays totally improvised, 
  psychedelic space rock. I really like the band&#8217;s ideology to offer most 
  of their rehearsal and live jams for their fans free though internet. This is 
  their third studio album and has three tracks on it. The first couple (&#8221;RumBle&#8221; 
  and &#8221;The Black Tomato&#8221;) are very long and divided into several parts 
  to make the listening easier. The band&#8217;s line-up varies a bit, but they 
  usually have two guitar players, three keyboard/synthesiser players, a bass 
  player and a drummer on board. This album features two different bassists and 
  three guitar players. After a few years of jamming together there has been a 
  lot of progress and the group plays very well together. They can now also play 
  without restraints and with full power in the studio, as well. Black Tomato 
  includes perhaps the group&#8217;s heaviest stuff, and the guitar players are 
  really flying high with their solos at their best. There are also some really 
  cosmic, floating parts. The rhythm section is tighter than ever before. Some 
  of the groovy rhythms and synthesiser things bring to mind Ozric Tentacles, 
  and there are also contact points for example to many old German acid/jam bands 
  like Ash Ra Temple and Cosmic Jokers. Some of the parts also bring to mind old 
  Gong. Most of all, the band mainly sounds like no-one else except themselves. 
  The listener might just need to take something to get in the right mood and 
  close his or her eyes, and the music will take him or her to most wondrous places. 
</p>
<p>There are no overdubs used on the album so all the music you hear was recorded 
  live. As an effect, they have for example used some narration is Russian to 
  some of the tracks of &#8220;RumBle&#8221; which is a great and hallucinatory 
  extra feature. It&#8217;s totally impossible to name my favourites since the 
  album works excellently as a whole. The mixing and mastering job is also very 
  well done, and so Black Tomato is absolutely one of the best albums this year 
  and highly recommended!! I would also like to see them live at Roadburn, please...</p>
<p>www.oresundspacecollective.com <br>
  03.09.07 by Dj Astro</p>
<hr noshade color="#808080">
<p><strong>&Oslash;resund Space Collective - &quot;The Black Tomato&quot; <br>
  (Transubstans 2007, trans032) </strong></p>
<p>From Aural Innovations #37 (September 2007) </p>
<p>Wow, these guys are really on a roll. Hot on the heels of their outstanding 
  2-CD &quot;It's All About Delay&quot; album, &Oslash;resund Space Collective 
  (OSC) are back with a brand new set of space jams. The Black Tomato consists 
  of three tracks, totalling nearly 80 minutes of all instrumental improvisational 
  space rocking bliss. </p>
<p>The CD kicks off with the nearly 40 minute &quot;RumBle&quot;, which begins 
  with a stoned jamming cosmic hard rocking space groove. There's some ripping 
  trip guitar, freaked out alien electronics, and the whole atmosphere is like 
  a deep space stoner acid jam. This is some of the heaviest music I've heard 
  from OSC yet. And as you can imagine on a 40 minute improv jam, the music twists 
  and turns through a multitude of moods and themes, though of course the key 
  to real appreciation is to just sit back and surrender yourself to wherever 
  the band wants to take you. It's a guided tour with the focus on the voyage 
  and destination is the least of your concerns. OSC have a fluid cast of participants 
  but everyone has more or less played with each other enough that it's no surprise 
  that they continue to crank out ass kicking space jams that you can groove to 
  endlessly! Some of it brings to mind a cross between Ozric Tentacles and Alien 
  Planetscapes. </p>
<p>Next up is the 32 minute &quot;The Black Tomato&quot;, another space rocking 
  excursion. It's got some killer melodic development that really hooked me, while 
  retaining the driving jam quality throughout. The organ and heavy keyboards 
  give the music a 70s hard prog-psych edge that I really liked, and combined 
  with the electronics, guitars and pounding rhythm section makes for an absolutely 
  awesome space rock journey. Lots of cool Gong/Hillage elements and I even detected 
  some moments of Frippertronic styled guitar, but mostly this is searing acidic 
  mucho cosmic heavy jamming space rock. OSC have cultivated a real knack for 
  taking off and exploring while keeping these loooooong jams comprehensible and 
  consistently seductive throughout. Finally, rounding out the set is the relatively 
  short (6 minutes) &quot;Viking Cleaner&quot;, a quirky, playful, but totally 
  spaced out rhythmic groove tune that makes for an appropriate finale to this 
  outstanding set. These guys gotta start making the rounds of the festival circuit. 
</p>
<p>For more information you can visit the &Oslash;resund Space Collective web 
  site at: http://www.oresundspacecollective.com. <br>
  There are STILL many hours of jams you can download from their site! </p>
<p>Reviewed by Jerry Kranitz </p>
<p><a href="http://www.aural-innovations.com/issues/issue37/osc03.html">http://www.aural-innovations.com/issues/issue37/osc03.html</a></p>
<hr noshade color="#808080">
<p><strong>Oresund Space Collective &#8211; The Black Tomato (2007): </strong></p>
<p>Terceiro disco para este projecto multinacional (Dinamarca, Su&eacute;cia e 
  USA). S&atilde;o mais 77:11 de improvisa&ccedil;&atilde;o Space Rock / Prog 
  / Psychedelic / Krautrock. Nesta nova proposta s&atilde;o apresentados apenas 
  3 temas mas est&atilde;o divididos em 9 faixas. Para quem j&aacute; conhece 
  o projecto, j&aacute; sabe o que esperar. Para quem n&atilde;o conhece, pode-se 
  alinhar uma s&eacute;rie de nomes de refer&ecirc;ncia como Hawkwind, Gong, Ozric 
  Tentacles, Tangerine Dream, The Spacious Mind ou Hidria Spacefolk, entre outros. 
  &Eacute; mais do mesmo, mas &eacute; mais do melhor que se faz hoje em dia no 
  g&eacute;nero. Recomendo! Salienta-se ainda a disponibiliza&ccedil;&atilde;o 
  do projecto de todas as suas &#8220;jam sessions&#8221; no seu &#8220;website&#8221; 
  oficial, podendo os f&atilde;s fazer o &#8220;download&#8221; gratuito de cerca 
  de 35 horas de material. Al&eacute;m disso, todas as suas actua&ccedil;&otilde;es 
  ao vivo est&atilde;o tamb&eacute;m dispon&iacute;veis no &#8220;website&#8221; 
  Live Archive (http://www.archive.org/). 80% </p>
<p><a href="http://fenixwebzine.blogspot.com/2007/09/transubstans-records.html">http://fenixwebzine.blogspot.com/2007/09/transubstans-records.html</a></p>
<p>This one is not really a review but the guy just typed in the stuff from the 
  promo sheet... Strange... Why bother...</p>
<hr noshade color="#808080">
<p><strong>&Ouml;resund Space Collective- The Black Tomato (Transubstans Records 
  2007)</strong></p>
<p>track 1-5 RumBle 38:35<br>
  track 6-8 The Black Tomato 32:05<br>
  track 9 Viking Cleaner 6:28<br>
  <br>
  Har skrivit tidigare om denna sp&auml;nnande grupp med r&ouml;tter fr&aring;n 
  USA, Danmark och Sverige. Detta &auml;r deras andra &#8221;riktiga&#8221; platta. 
  ( Det finns &auml;ven ett helt g&auml;ng plattor som gruppen s&auml;ljer p&aring; 
  sin hemsida). Musiken utg&ouml;rs, liksom tidigare, av l&aring;nga improviserade 
  jam. Om man t&auml;nker sig The Spacious Mind med sina mycket subtila och st&auml;mningsfulla 
  ljudlandskap p&aring; ena sidan och p&aring; den andra First Band From Outer 
  Space med sin manglande och tunga spacerock. N&aring;nstans d&auml;remellan 
  glider &Ouml;resund Space Collective.</p>
<p>Om man ogillar denna musik, kanske upplever den som monoton och seg, s&aring; 
  kan det bero p&aring; att man faktiskt lyssnar p&aring; fel s&auml;tt. Gl&ouml;m 
  att leta efter catchiga refr&auml;nger eller zappa omkring f&ouml;r att hitta 
  n&aring;t speciellt. Det &auml;r lika meningsl&ouml;st som att avnjuta en god 
  whisky genom att h&auml;va i sig ur flaskan. Nej, h&auml;r m&aring;ste man ta 
  sig tid. G&auml;rna under en l&auml;ngre bilf&auml;rd eller med h&ouml;rlurar. 
  F&ouml;rst d&aring; uppt&auml;cker man nyanserna och hur musiken sakta, n&auml;stan 
  om&auml;rkligt, &auml;ndrar karakt&auml;r. L&aring;tarna blir som l&aring;nga 
  hypnotiska resor. Ibland rockar det till ocks&aring; s&aring; h&auml;r finns 
  hela spektrat. &Aring;terigen kan jag varmt rekommendera &Ouml;.S.C. Det h&auml;r 
  &auml;r sj&auml;lva essensen av spacerock!</p>
<p>Skulle g&auml;rna ha detta som soundtrack till min n&auml;sta konstutst&auml;llning!<br>
  Betyg 7,5 / 10<br>
  Dennis Jacobsson </p>
<p><a href="http://www.artrock.se/artrock2007/recension_150.htm">http://www.artrock.se/artrock2007/recension_150.htm</a></p>
<hr noshade color="#808080">
<p>&nbsp;</p>
<p>&nbsp;</p>
<hr noshade color="#808080">
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<hr noshade color="#808080">
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp; </p>
</body>
</html>
