<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Session 43 Diary</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body background="../IMAGES/backgrounds/starsnatural.jpg" text="#FFFF00">
<p align="center"><strong><font size="5">Session 43, Slottsskogen Goes Progressive 
  Festival 2008</font></strong><font size="3"></font></p>
<p align="left"><font size="3">8:35 Magnus arrives and Mogens got here right on 
  time at 8:30. IT is very difficult to get all of our stuff into Magnus's car 
  but we manage and are off around 9 to tobias's where we will off load all the 
  stuff into the van and meet the rest of the band. </font></p>
<p align="left">9:30 We arrive at Tobias's house just at the same time as Kaufmann, 
  Jock, Lasse and his friend. The van will be packed. It was a gough job but we 
  got it all in. </p>
<p align="left">10:03 We hit the road! Everyone is in a very good mood. We listen 
  to the new Dream Machine CD and people think it is pretty cool.</p>
<p align="left">10:45 We take a smoke break and people buy some drinks. </p>
<p align="left">13:27 We arrived just before 13:00 and it is a great day and the 
  place is just like it was when I played here 2 years ago with First Band from 
  Outer Space. One of the bands is soundchecking and we have the option to go 
  next but it seems pointless as Anekdoten will not do a sound check and have 
  their own sound guy who will set everything new. We just kick back in the backstage 
  and meet some of the other bands and the organizers and have a few drinks, chips, 
  juice and fruit. They are recording the whole thing digitially on 32 tracks 
  so we did not hook up our own hard disc recorder. </p>
<p align="left">14:45 I have set up the merchandise stand and passing out flyers 
  and I put up some posters for the Space Rock Odessey 2008 Festival we will play 
  at in Upssala, Sweden in two weeks. </p>
<p align="left">15:10 The first band starts. Johan Rand&eacute;n, a young jazz 
  fusion guitarist. They play a pretty cool set of tunes. Promising young guitar 
  player. </p>
<p align="left">18:00 We had a really nice buffet dinner. I had the Jambylaya 
  and some salad and a beer. Nice food. Things are progressing on time. Yeah...</p>
<p align="left">19:35 Anekdoten are suppose to be playing but it takes them a 
  really long time and the last band put the schedule off by 10 mins. It is not 
  that bad but still if they make it stop at exactly 23, that is 10mins off our 
  time. </p>
<p align="left">20:00 Anekdoten finally start 30mins late. We are pretty fucked 
  now and will never get to play our full 90 mins. </p>
<p align="left">21:20 Anekdoten are finished and we are trying to get our stuff 
  on as they are getting their stuff off, a bit of a mess but time is short. We 
  hurry as much as we can and it is chaos.</p>
<p align="left">&nbsp;</p>
<p align="left">00:50 We finally got to hit the stage about mins to 22 when we 
  started. Sound on the stage was insane. It is impossible to play our kind of 
  music with out a proper sound check. Gig is basically a disaster. I think it 
  was very psychedelic though. After 30 mins Johan from First band from Outer 
  SPace joined us and that was cool to have three guitar players. I was too loud 
  in the monitors, the guitar players could not hear each other that well. Mogens 
  could not hear anything almost so he said he only played safe stuff and was 
  not willing to experiment. I was totally crazy and playing wild insane stuff 
  as my head was spinning for the first 30 mins and then I really settled into 
  the sound and felt like it went fine. Th crowd up front was totally into it. 
  A good 150 people really staying glued and wanting more. ORganziers and sound 
  guys thought we were cool. I am not so sure. I will have to hear the recordings. 
  It was for sure very psychedelic.</p>
<p align="left">1:30 We arrive at the FBFOS rehearsal studio and have some beers 
  and joints and crash out around 3 or so. Fun day and great people..</p>
<p><strong>Set List:</strong></p>
<p>Introduction, Psychedelic Storm is a Coming, Magnus and the 3 Eyed Girl, Breaking 
  down the Barrier, Outro</p>
<p><br>
  <strong>Here is a review of the gig in Swedish:</strong></p>
<p>&Ouml;resund Space Collective</p>
<p>Slottsskogen Goes Progressive 16 aug. 2008 </p>
<p><br>
  Jag tycker &aring;rets upplaga ( nummer nio!) av festivalen &ouml;vertr&auml;ffade 
  alla andra. Dels var v&auml;dret perfekt, det var det rekordmycket folk och 
  framf&ouml;r allt: banden var b&aring;de genrem&auml;ssigt spridda och hade 
  en grym niv&aring;. Jag menar B&Ouml;RJA med Synkopaterna! Fast spelordningen 
  kunde vara hur som helst. Men det fanns en anledning att l&auml;gga &Ouml;resund 
  Space Collective sist. Och den anledningen heter skymning. S&aring;n h&auml;r 
  musik med tillh&ouml;rande ljusshow m&aring;ste upplevas n&auml;r det &auml;r 
  m&ouml;rkt. </p>
<p>H&auml;rlige amerikanen Scott Heller som h&aring;ller i rodret var med p&aring; 
  First Band From Outer Space&acute;s spelning h&auml;r. Nu &auml;r det dags f&ouml;r 
  Johan From Space att g&auml;sta kv&auml;llens band och f&ouml;rst&auml;rka gitarrsektionen. 
  &Ouml;.S.C. &auml;r ett unikt band som bara k&ouml;r improviserad musik. D&auml;rf&ouml;r 
  &auml;r de b&auml;st live. Det &auml;r liksom &#8221;h&auml;r-och-nu&#8221; 
  som g&auml;ller och ingen vet vart resan tar v&auml;gen. De l&aring;nga styckena 
  b&ouml;rjar ofta lite d&auml;mpat och monotont f&ouml;r att sedan byggas upp 
  och intensifieras. Alla ser verkligen ut att ha kul, inte minst Johan. Ett tag 
  tar Scott p&aring; sig en alienmask f&ouml;r att sedan k&ouml;ra sina syntheffekter 
  ikl&auml;dd en k&aring;pa med texten &#8221;Dr Space&#8221; och en h&ouml;g 
  trollkarlshatt. Jag st&aring;r hela tiden och njuter med ett leende p&aring; 
  l&auml;pparna. En s&aring;n kille m&aring;ste man ju bara &auml;lska.</p>
<p>Efter den n&auml;st sista l&aring;ten tittar Scott p&aring; klockan och konstaterar 
  att det &auml;r 15-20 minuter speltid kvar. Och s&aring; lyfter killarna iv&auml;g 
  en stund till. En st&auml;mningsfull och v&auml;rdig avslutning p&aring; en 
  fantastisk afton. Amen. </p>
<p><br>
  Dennis Jacobsson<br>
</p>
<p>&nbsp; </p>
</body>
</html>
